**create a dataframe using list**

In [ ]:
-list ===dictionary
-dictionary=====list

$step-1$:
**create a empty dataframe**

In [2]:
import pandas as pd
names=pd.DataFrame({"names":['sonali','saipriya','sai'],"age":[25,56,7],"place":['hyd','chennai','blr']})
names #empty dataframe no rows and no columns

      names  age    place
0    sonali   25      hyd
1  saipriya   56  chennai
2       sai    7      blr

$step-2$ : 
**provide a data**

In [3]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
pd.DataFrame(zip(names,age,place))
# what is the first positional argument:data: names
#secong positional argument:index : 0,1
#zip==============combined by one

          0   1        2
0    sonali  25      hyd
1  saipriya  56  chennai
2       sai   7      blr

In [4]:
names={'sonali','saipriya','sai'}
pd.DataFrame(names)

          0
0       sai
1  saipriya
2    sonali

In [5]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
data=(zip(names,age))
pd.DataFrame(data,place)

                0   1
hyd        sonali  25
chennai  saipriya  56
blr           sai   7

$step-3$:
**columns name**

In [6]:
names=['ayush','avanish','akash']
age=[25,56,7]
place=['hyd','chennai','blr']
salary=[1000,5000,9000]
pd.DataFrame(zip(names,age,place,salary),columns=['names','age','place','salary'])

     names  age    place  salary
0    ayush   25      hyd    1000
1  avanish   56  chennai    5000
2    akash    7      blr    9000

In [7]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
data=(zip(names,age,place))
pd.DataFrame(data,columns=['names','age','place'])

      names  age    place
0    sonali   25      hyd
1  saipriya   56  chennai
2       sai    7      blr

In [8]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
cols=['names','age','place']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols)
#dataframe is ready we are saving data(df)

In [68]:
type(df)

pandas.core.frame.DataFrame

$step-4$:
**add new column**

- if you want to add new column
- first you need to check the num of rows in already existed data
- for example in above the dataframe has 3 rows
- you need to create a new list with 3 rows
- the list equate to the dataframe

In [9]:
job=['ds','de','cs']
df['job']=job
df

      names  age    place job
0    sonali   25      hyd  ds
1  saipriya   56  chennai  de
2       sai    7      blr  cs

In [10]:
salary=[1000,20000,30000]
df['salary']=1000,20000,30000
df

      names  age    place job  salary
0    sonali   25      hyd  ds    1000
1  saipriya   56  chennai  de   20000
2       sai    7      blr  cs   30000

$step-5$:
**update the already existed column**
- creative new column and update

In [11]:
df['age']=[35,78,54]
df

      names  age    place job  salary
0    sonali   35      hyd  ds    1000
1  saipriya   78  chennai  de   20000
2       sai   54      blr  cs   30000

$step-6$:
**change the index**

In [167]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
cols=['names','age','place']
indx=['a','b','c']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols,index=indx)
df['job']=['ds','de','cs']
df['salary']=[1000,20000,30000]
df

      names  age    place job  salary
a    sonali   25      hyd  ds    1000
b  saipriya   56  chennai  de   20000
c       sai    7      blr  cs   30000

$step-6$:
**change the index**

In [3]:
names=['sonali','saipriya','sai','foodie']
age=[25,56,7,45]
place=['hyd','chennai','blr','mumbai']
cols=['names','age','place']
idx=['a','b','c','d']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols,index=idx)

df

NameError: name 'pd' is not defined

**NOTE**
- Num of list equals to **number of columns**
- num  of values inside list equals to **number of rows**
- when you create the data all the lists will be in the same length

In [4]:
import pandas as pd

In [22]:
names=['sonali','saipriya','sai','foodie']
age=[25,56,7,45]
place=['hyd','chennai','blr','mumbai']
cols=['names','age','place']
idx=['a','b','c','d']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols,index=idx)
df['job']=['ds','de','cs','fg']
df['salary']=[1000,20000,30000,5000]
df

      names  age    place job  salary
a    sonali   25      hyd  ds    1000
b  saipriya   56  chennai  de   20000
c       sai    7      blr  cs   30000
d    foodie   45   mumbai  fg    5000

$step-7$:
**shape**
- number of rows
- number of columns

In [114]:
df.shape
#matrix format
# 4 rows and 3 columns
print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

$step-8$
**drop the column**
- in order to drop column we required 3 arguments
- column name
    - the column we need to mention
- axis (# interview )
     - axis=0 **represents rows**
     - axis=1 **represents columns**
- inplace
  -  we are drop column means we are modifying the data frame
  - so this modification we want to save in save variable or different variable
  -  if you want to keep in the same variable the **inplace=True**

In [2]:
df

NameError: name 'df' is not defined

In [134]:
df.drop('age',axis=1,inplace=True)
df

      names
a    sonali
b  saipriya
c       sai
d    foodie

In [135]:

df

      names
a    sonali
b  saipriya
c       sai
d    foodie

In [136]:
df.drop('names',axis=1)
df

Empty DataFrame
Columns: []
Index: [a, b, c, d]

In [145]:
df

      names  age    place
a    sonali   25      hyd
b  saipriya   56  chennai
c       sai    7      blr
d    foodie   45   mumbai

$step-9$:
**multiple columns drop**

In [165]:
#again read the data
names=['sonali','saipriya','sai','foodie']
age=[25,56,7,45]
place=['hyd','chennai','blr','mumbai']
cols=['names','age','place']
idx=['a','b','c','d']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols,index=idx)

df

      names  age    place
a    sonali   25      hyd
b  saipriya   56  chennai
c       sai    7      blr
d    foodie   45   mumbai

In [162]:
df.drop(['a','b'],axis=0,inplace=True)
df                                              # multiple columns

    names  age   place
c     sai    7     blr
d  foodie   45  mumbai

In [157]:
df

      names  age    place
b  saipriya   56  chennai
c       sai    7      blr
d    foodie   45   mumbai

In [159]:
df

      names  age    place
a    sonali   25      hyd
b  saipriya   56  chennai
c       sai    7      blr
d    foodie   45   mumbai

In [166]:
df.drop(['place','age'],axis=1,inplace=True)
df

      names
a    sonali
b  saipriya
c       sai
d    foodie

In [201]:
names=['sonali','saipriya','sai']
age=[25,56,7]
place=['hyd','chennai','blr']
cols=['names','age','place']
indx=['a','b','c']
data=(zip(names,age,place))
df=pd.DataFrame(data,columns=cols,index=indx)
df['job']=['ds','de','cs']
df['salary']=[1000,20000,30000]
df

      names  age    place job  salary
a    sonali   25      hyd  ds    1000
b  saipriya   56  chennai  de   20000
c       sai    7      blr  cs   30000

In [195]:
df.drop(['job','salary'],axis=1,inplace=True)
df

      names  age    place
a    sonali   25      hyd
b  saipriya   56  chennai
c       sai    7      blr

$step-10$:
**drop the rows**

In [196]:
df.drop('a',axis=0,inplace=True)
df

      names  age    place
b  saipriya   56  chennai
c       sai    7      blr

$step-11$:  
**how to save in local dataframe**

- generally data frames are two types 
- csv (comma separated value)
- excel

In [6]:
# file name=data
# extension=.csv
df.to_csv('data2.csv')
df.to_csv('data1.csv',index=False)

PermissionError: [Errno 13] Permission denied: 'data2.csv'

In [205]:
df=pd.read_

ValueError: No engine for filetype: ''

In [17]:
import pandas as pd 
import numpy as np
import

ModuleNotFoundError: No module named 'matplot'

**numerical vs numerical**

In [ ]:
- to understand numerical columns relation we need to plot scatter plots 
- scatter plots gives the relation between two numerical columns 
- bar chart pie chart histogram scatter plots
- scatters plot under matplotlib package
.plt.scatter

In [15]:
x=[1,2,3,4,5]
y=[1,2,3,4,5]
plt.scatter(x,y)

NameError: name 'plt' is not defined

In [ ]:
x=[i for i in range(-10,11)]
y=[i*i for in x]
plt.scatter(x,y)
plt.scatter(

In [ ]:
it denotes

**method name is corr**

In [18]:
visa_df.corr()

NameError: name 'visa_df' is not defined

**heat map**

**encoding**

- encoding means convert categorical columns data to numerical data
- because ml models expect the data should be in numerical 
- ml models developed by math algorithms
it is very very important to apply encoding
- the following methods are 
  - map 
  - np.where
  - one hot encoding
  - label encoder

**map**
- map is one method to convert categorical values to numerical
- take one categorical column
- get the unique lables first
- make a dictionary with assign a num to each label
- for example case_status has two labels
- certified
- denied
- assign 0 to certified ,1 to denied
- create a dictionary labels as keys, num as values only
- {'certified :'0',denied':1}

In [ ]:
make a dictionary apply the map